<?php

    $profile_to_checklists = [
        'РИ' => [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        'Р' => [1, 0, 1, 1, 0, 1, 0, 1, 0, 0],
        'И' => [1, 1, 1, 0, 1, 1, 1, 1, 1, 1],
        'У' => [1, 1, 1, 0, 1, 1, 1, 1, 1, 1],
        'Д' => [1, 0, 1, 0, 0, 1, 1, 1, 1, 1]
    ];

    $profile_to_checklists_weights = [
        'РИ' => [0.05, 0.15, 0.10, 0.15, 0.10, 0.10, 0.15, 0.05, 0.10, 0.05],
        'Р' => [0.05, 0.00, 0.10, 0.55, 0.00, 0.20, 0.00, 0.10, 0.00, 0.00],
        'И' => [0.05, 0.20, 0.10, 0.00, 0.15, 0.15, 0.15, 0.05, 0.10, 0.05],
        'У' => [0.05, 0.15, 0.10, 0.00, 0.15, 0.15, 0.15, 0.10, 0.10, 0.05],
        'Д' => [0.10, 0.00, 0.10, 0.00, 0.00, 0.20, 0.15, 0.05, 0.30, 0.10]
    ];

    $profile_to_full = [
        'РИ' => 'Разработчик-изготовитель',
        'Р' => 'Разработчик',
        'И' => 'Изготовитель',
        'У' => 'Услуги',
        'Д' => 'Дилер',
        'Др' => 'Другое'
    ];

    $criteria_numbers = [
        0 => 10,
        1 => 30,
        2 => 50,
        3 => 16,
        4 => 13,
        5 => 30,
        6 => 38,
        7 => 15,
        8 => 11,
        9 => 17,
    ];

    $criteria_titles = [
        0 => 'Деятельность на стадиях ЖЦП',
        1 => 'Производство',
        2 => 'Производственная система',
        3 => 'Разработка и постановка на производство',
        4 => 'Технология',
        5 => 'СМК',
        6 => 'Контроль качества',
        7 => 'Управление персоналом',
        8 => 'Закупки',
        9 => 'Складское хозяйство'
    ];

    $criteria_full_titles = [
        0 => 'Деятельность на стадиях жизненного цикла продукции (ЖЦП) и услуг',
        1 => 'Производство',
        2 => 'Производственная система — ПС (бережливое производство)',
        3 => 'Разработка и постановка на производство',
        4 => 'Технология',
        5 => 'Управление качеством (система менеджмента качества)',
        6 => 'Контроль качества',
        7 => 'Управление персоналом',
        8 => 'Закупки',
        9 => 'Складское хозяйство'
    ];

    $coeff_to_num = [
        '1.00' => 1,
        '(1)0.90' => 0.9,
        '(2)0.90' => 0.9,
        '0.80' => 0.8
    ];

    $checklist_color = [
        0 => ['#bffbff', '#ace3e7', '#68d2da', '#62c6ce', '#c4e2e5'],
        1 => ['#e4e4e4', '#d3d3d3', '#555555', '#333333', '#cccccc'],
        2 => ['#ffb257', '#ffa030', '#ff9e2c', '#f88c0c', '#ffdaae'],
        3 => ['#d6e9f9', '#bcd7ee', '#65a9e4', '#5091ca', '#c4e0f8'],
        4 => ['#efe0ba', '#dfc995', '#b6a477', '#988963', '#e5d09d'],
        5 => ['#d3ffb3', '#b7e296', '#90cf61', '#84bf57', '#ccf1b0'],
        6 => ['#ff9770', '#ff8051', '#ff723d', '#e15d2b', '#ffb79c'],
        7 => ['#efc4ef', '#eb94eb', '#dc71dc', '#c558c5', '#f9c8f9'],
        8 => ['#fff68e', '#ffe667', '#f4cd00', '#e2c00b', '#ffee97'],
        9 => ['#b5b4e5', '#979cd7', '#6e6cd7', '#5d5bce', '#c8c7f2']
    ];

    function get_array_of_ns ($n, $val) {
        $arr = [];
        for ($i = 0; $i < $n; $i++) {
            $arr[] = $val;
        }
        return $arr;
    };

    $checklists = [
        0 => [
            'title' => 'Деятельность на стадиях ЖЦП',
            'categories' => [
                [
                    'Планирование и управление деятельностью на стадиях жизненного цикла продукции (ЖЦП) и услуг',
                    'Анализ требований к продукции',
                    'Анализ и оценка '
                ],
                [
                    [0, 1, 2, 3],
                    [4, 5, 6, 7, 8],
                    [9]
                ]
            ],
            'criteria' => [
                'Осуществляется планирование, разработаны и реализованы процессы, необходимые для создания продукции (выполнения работ) в соответствии с условиями контракта (договора), требованиями ТЗ, ТУ,  ДСОП и других документов, распространяющихся на выпускаемую продукцию (выполняемые работы). Установлен порядок управления процессами ЖЦП и обеспечения их ресурсами. Определены  подразделения, задействованные в планировании и управлении процессами ЖЦП.',
                'Управление конфигурацией осуществляется в соответствии с ГОСТ Р 59193-2020 или другими ДС. Управление конфигурацией включает в себя следующие процедуры (виды деятельности):<br>а) планирование управления конфигурацией;<br>б) идентификация конфигурации (формализация состава и структуры изделия, определение контролируемых характеристик изделия);<br>в) аудит конфигурации (проверка документации и контроль (испытания изготовленного изделия);<br>г) управление изменениями конфигурации (внесение всех согласованных изменений в КД и ТД).',
                'Осуществляется планирование, реализация и контроль соблюдения установленных требований к безопасности продукции.',
                'Осуществляется планирование, реализация и контроль мероприятий по предотвращению применения продукции, предполагаемой как контрафактная.  Мероприятия включают в себя:<br>а) разработку требований о применении конкретных методов контроля приобретаемых КИ, материалов (сырья);<br>б) формирование требований к обеспечению прослеживаемости изделий, КИ, материалов (сырья);<br>в) обучение персонала вопросам обнаружения контрафактной продукции.',

                'Осуществляется рассмотрение проектов контрактов (договоров) с последующим их заключением (подтверждается документированной информацией об анализе контрактов (договоров)).',
                'Осуществляется периодический контроль и анализ выполнения контрактов (договоров).',
                'Осуществляется оценка требований к продукции (работам, услугам), заданных условиями контракта (договора) и требованиями ТЗ, ТУ.',
                'Осуществляется регистрация и хранение документированной информации в отношении результатов анализа и любых новых требований к продукции и услугам.',
                'Осуществляется внесение изменений в контракт (договор), учитывающих дополнительные требования к продукции (работам, услугам) и информация о внесенных изменениях доводится до соответствующего персонала.',

                'Осуществляется анализ и оценка информации об успешности планирования. Определены методы анализа и оценки. '
            ],
            'standard' => [
                '8.1 (8.1.2, 8.1.3)',
                '8.1 (8.1.5)',
                '(8.1.6)',
                '(8.1.7)',

                '8.2.1 (8.2.1.2)',
                '(8.2.1.3)',
                '8.2.3.1 (8.2.3.3, 8.2.3.4)',
                '8.2.3.2 (8.2.3.3, 8.2.3.4)',
                '8.2.4 (8.2.4.2)',

                '9.1.3 d) (9.1.3.3)'
            ],
            'weights' => [
                2, 1, 1, 1,
                1, 1, 1, 1, 1,
                1
            ],
            'custommarks' => []
        ],
        1 => [
            'title' => 'Производство',
            'categories' => [
                [
                    'Основные требования к производству',
                    'Организация рабочих мест (РМ)',
                    'Технологическое оборудование (станки, прессы, стенды, подъемники и т.п.)',
                    'Технологическая оснастка (пресс-формы, литейные формы, инструмент, приспособления и т.п.)',
                    'Идентификация и прослеживаемость продукции',
                    'Межоперационная тара и внутренние перемещения продукции',
                    'Внутренняя упаковка готовой продукции и оформление ЭД',
                    'Культура производства'
                ],
                [
                    [0, 1, 2],
                    [3, 4, 5, 6, 7],
                    [8, 9, 10, 11, 12, 13, 14, 15],
                    [16, 17, 18, 19, 20],
                    [21, 22],
                    [23, 24, 25],
                    [26, 27],
                    [28, 29]
                ]
            ],
            'criteria' => [
                'Разработан, внедрен регламент процесса «Производство», определяющий порядок управления производством. Поддерживается взаимодействие со смежными бизнес-процессами.',
                'Наличие управляемого производственного плана на текущий период.',
                'Наличие Плана  по закупке нового оборудования и техники, новых технологий.',

                'Соответствие оснащения РМ требованиям технологического процесса, состояние).',
                'Наличие на рабочих местах комплектов КД и ТД на продукцию с литерой, утвержденной заказчиком и других документов (утвержденных выписок, идентифицированных фрагментов из КД и ТД), регламентирующих порядок и способы приемки и контроля продукции с предыдущей операции, порядок и способы выполнения технологических и контрольных операций, порядок регистрации результатов выполненных операций и передачи продукции на последующие операции.',
                'Аттестация  (специальная оценка) рабочих мест по условиям труда.',
                'Общее техническое состояние производственного помещения (состояние крыши, остекления, полов, подъездов и т.п.).',
                'Обеспечивается соблюдение установленных требований к условиям производства (среда для функционирования процессов). Журналы контроля актуальны на дату проверки и соответствуют требованиям, установленным в документированной процедуре.',

                'Учет имеющегося оборудования (документированная процедура по управлению производственным оборудованием, актуальность записей). Идентификация оборудования в производственном помещении (наличие, полнота).',
                'Производственные рабочие обучены работе на оборудовании, владеют инструкциями и требованиями к качеству.',
                'Наличие необходимой базы ресурсов для выполнения ремонта оборудования.<br>Имеется:<br>– квалифицированный персонал;<br>– оборудование;<br>– расходные материалы и инструмент;<br>– наличие договоров на обслуживание и ремонт оборудования в сторонних организациях.',
                'Техническое обслуживание и ремонтные работы на применяемом технологическом оборудовании проводятся по графику, согласованному с руководителем подразделения, применяющего данное оборудование.',
                'Технологическое оборудование имеет ЭД, используется в пределах сроков, установленных ЭД на это оборудование.',
                'Наличие, актуальность, выполнение графика проверки оборудования на технологическую точность. Наличие Документированной процедуры, устанавливающей порядок организации и проведения проверки оборудования на технологическую точность.',
                'Наличие дублирующего оборудования на особо критичных операциях технологического процесса или плана действий в случае аварийной остановки производства, по причине выхода из строя оборудования (если приобретение дублирующего оборудования нецелесообразно).',
                'Размещение оборудования оптимально и учитывает требования по оптимизации внутрицеховых (межцеховых) перемещений.',

                'Учет имеющейся оснастки (документированная процедура по  управлению технологической оснасткой, актуальность записей). ',
                'Идентификация оснастки в производственном помещении (наличие, полнота). ',
                'Наличие дублирующей оснастки на особо ответственных операциях технологического процесса или плана действий в случае аварийной остановки производства, по причине вывода из строя (если приобретение дублирующего оборудования нецелесообразно).',
                'Организация контроля за техническим состоянием оснастки и инструмента, идентификация пригодности, документирование выдачи, учёт.',
                'Наличие и состояние необходимой базы ресурсов для изготовления и ремонта технологической оснастки<br>Имеется:<br>– квалифицированный персонал;<br>– оборудование;<br>– расходные материалы и инструмент;<br>– наличие договоров на обслуживание и ремонт оснастки в сторонних организациях.',

                'Определен порядок идентификации, позволяющий установить соответствие состояния изделия его описанию в документации при прохождении входного контроля, хранении, изготовлении и испытаниях.',
                'Выполнение требований по идентификации (маркировка, бирки) заготовок, полуфабрикатов, деталей и изделий на всех этапах производственного процесса. Установлен контроль за принятыми средствами идентификации (штампы (печати), ярлыки, этикетки).',

                'Наличие, актуальность, выполнение требований по внутренней и межоперационной транспортировке изделий, определяющих сохранность продукции.',
                'Наличие и выполнение требований (КД, регламент) к внутризаводской таре.',
                'Управление межоперационными запасами на производстве (наличие, актуальность, выполнение требований).',

                'Наличие требований к упаковке готовой продукции, включая идентификацию (КД, ТУ, документированная процедура, рабочие инструкции).',
                'Выполнение требований к внутренней упаковке готовой продукции и наличию сопроводительной документации в соответствии с условиями поставки.',

                'Требования к культуре производства (наличие, полнота, актуальность документированной процедуры).',
                'Выполнение требований к культуре производства (поддержание чистоты на производстве, порядок на рабочих местах, в цехах, в служенных помещениях и на территории, внешний вид работников).'
            ],
            'standard' => [
                '4.4, 8.1, 8.5.1 (8.1.2, 8.5.1)',
                '8.5.1 (6.2.5)',
                '8.5.1, 10.1 (6.2.5 8.5.1.3 д, 10.1)',

                '7.1.3, 8.1 (7.1.3.2 в,  8.5.1.9 а)',
                '8.5.1 (8.5.1.9 б, е)',
                '7.1.4 (7.1.4)',
                '8.5.1 (8.5.1.9 д)',
                '7.1.4, 8.5.1 (7.1.4.2, 8.5.1.9 а)',

                '7.1.3 (7.1.3)',
                '7.2 (7.2.2)',
                '8.5.1 (8.5.1.8)',
                '8.5.1 (8.5.1.7)',
                '8.5.1 (8.5.1.6)',
                '8.5.1 (8.5.1.5)',
                'Требование ОСК',
                'Требование ОСК',

                '7.1.3 (7.1.3)',
                '7.1.3 (7.1.3)',
                'Требование ОСК',
                '7.1.3 (7.1.3)',
                '7.1.3 (7.1.3)',

                '8.5.2 (8.5.2.3)',
                '8.5.2 (8.5.2.3, 8.5.2.4)',

                '8.5.4 (8.5.4.2)',
                '8.5.4 (8.5.4.2)',
                'Требование  ОСК',

                '8.5.4 (8.5.4.3, 8.5.4.6)',
                '8.6 (8.6)',

                '7.1.4 (7.1.4.2)',
                '7.1.4'
            ],
            'weights' => [
                2, 1, 1,
                1, 1, 1, 1, 1,
                1, 1, 1, 1, 1, 1, 2, 1,
                1, 1, 1, 1, 1,
                1, 1,
                1, 1, 2,
                1, 1,
                1, 1
            ],
            'custommarks' => []
        ],
        2 => [
            'title' => 'Производственная система',
            'categories' => [
                [
                    'Управление',
                    'Персонал',
                    'Оборудование',
                    'Материалы',
                    'Производственная эффективность',
                    'Повышение качества'
                ],
                [
                    [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
                    [12, 13, 14, 15, 16, 17, 18],
                    [19, 20, 21, 22, 23],
                    [24, 25, 26, 27, 28, 29, 30, 31, 32],
                    [33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43],
                    [44, 45, 46, 47, 48, 49]
                ]
            ],
            'criteria' => [
                'На предприятии утверждена и актуальна в текущем периоде стратегия развития производственной системы (ПС) / стратегия повышения эффективности / повышения производительности труда (ПТ).',
                'Действует механизм управления эффективностью и ПТ, введен в действие регламентирующим документом.',
                'Осуществляется постановка целей по повышению эффективности и ПТ на год, цели соответствуют утвержденной стратегии развития ПС. Цели декомпозированы до уровня руководителей подразделений.',
                'Осуществляется планирование реализации проектов / мероприятий по повышению эффективности на год. План утвержден распорядительным документом.',
                'Сформировано подразделение по повышению эффективности производства или назначены сотрудники, в чьи должностные инструкции включены обязанности по повышению эффективности.',
                'Под председательством генерального директора сформирован орган, наделенный полномочиями по управлению эффективностью производства и управлению ПТ.',
                'Функционирует система подачи и реализации предложений по улучшению процессов от рабочего персонала.',
                'Разработан и введен в действие регламентирующий документ (положение, методика, стандарт и т.п.) по мотивации персонала за участие в разработке и реализации проектов / мероприятий по повышению эффективности процессов.',
                'Повышение эффективности процессов осуществляется не только в основных подразделениях, но и вспомогательных.',
                'Применяется визуальное управление.',
                'По результатам реализованных мероприятий продемонстрирована положительная динамика изменения эффективности производства и ПТ.',
                'Высший менеджмент проводит регулярные обходы подразделений с целью контроля реализации мероприятий по повышению эффективности производства и оценки культуры производства. При отклонении от плана реализуются корректирующие мероприятия, решения фиксируются в документах.',

                'Функционирует процедура планирования персонала по количеству и составу профессий под выполнение производственной программы. Проводится оптимизация численности персонала.',
                'Функционирует система управления трудоемкостью работ. Нормы трудоемкости устанавливаются на основании нормативных документов, отсутствует система закрытия работ по фактическим затратам (фактическим табелям). Выявлена положительная динамика изменения трудоемкости.',
                'Определяются навыки персонала, необходимые для выполнения операций; проводится оценка уровня навыков; для повышения уровня навыков проводится обучение, имеются подтверждающие документы.',
                'Разработаны и утверждены программы обучения персонала инструментам повышения эффективности (бережливого производства).',
                'В систему обучения и повышения квалификации персонала встроено обучение инструментам повышения эффективности (бережливого производства).',
                'Проводится анализ загрузки и эффективности работы персонала. Реализуются мероприятия по повышению загрузки и эффективности персонала.',
                'Введен механизм быстрой перебалансировки работ между производственным персоналом при изменении объемов производства. Существует практика привлечения вспомогательного персонала для поддержания необходимого уровня и гибкого регулирования производительности.',

                'Определен перечень оборудования в потоке, которое является критическим для выполнения производственного плана.',
                'Разработаны стандарты, инструкции по периодическому обслуживанию оборудования (например, плановое обслуживание, обслуживание оператором и т.п.). Требования стандартов, инструкций операторами выполняются.',
                'Для критического оборудования производится оценка эффективности его использования (например: OEE, коэффициент использования оборудования, коэффициент готовности и т.п.) или осуществляется учет простоев оборудования. Разрабатываются и реализуются мероприятия по повышению эффективности и сокращению простоев оборудования.',
                'Производится анализ процесса перехода с одного вида продукции на другой (переналадка), осуществляется оптимизация данного процесса со снижением времени переналадки, операции переналадки стандартизированы.',
                'Организован единый центр мониторинга работы критического оборудования. В случае аварийной остановки критического оборудования проводится автоматический вызов ремонтных служб, оповещение ответственных руководителей предприятия.',

                'Определены нормативы объема ТМЦ на складах. Места хранения определены и визуализированы. Используется система адресного хранения. Установлены правила пополнения ТМЦ.',
                'Установлены правила транспортировки ТМЦ со складов, включающие маршруты, виды транспортировки, порядок и т.п.',
                'Определены нормативы НЗП в производстве (материалы, комплектующие, полуфабрикаты, продукция и т.п.). Места хранения определены и визуализированы. Установлены правила пополнения материалов и комплектующих.',
                'Установлены правила транспортировки НЗП в производстве (материалы, комплектующие, полуфабрикаты, продукция и т.п.), включающие маршруты, виды транспортировки, тару, график и т.п.',
                'Перемещение НЗП (материалов, комплектующих, полуфабрикатов, продукции и т.п.) в производстве осуществляется по принципу «вытягивания» (транспортировка только по требованию заказчика).',
                'Поставка материалов и комплектующих на рабочие места осуществляется своевременно, простои производства из-за отсутствия материалов и комплектующих отсутствуют.',
                'При выдаче материалов и комплектующих применяются принципы FIFO («первым пришёл — первым ушёл»), FEFO («первый истекает — первый выходит»).',
                'Произведен расчет производственного, буферного и страхового запасов. Уровень НЗП в потоке анализируется, наблюдается положительная динамика снижения запасов.',
                'При наличии простоев производства из-за отсутствия материалов и комплектующих разрабатываются и реализуются корректирующие мероприятия.',

                'Производственная способность предприятия обеспечивает выполнение производственной программы, что подтверждается соответствующими расчетами.',
                'Осуществляется планирование производства по номенклатуре, позволяющее поддерживать непрерывный поток производства и обеспечить и соблюдение сроков.',
                'Производство на каждом этапе запускается при возникновении потребности на следующем переделе (производство основано на принципе «вытягивания»).',
                'Анализируются материальные и информационные потоки; строятся карты потоков; выявляются «узкие» места в процессах; разрабатываются и реализуются мероприятия по повышению эффективности производства.',
                'Организованы эталонные (образцовые) участки с применением принципов и инструментов производственной системы (бережливого производства).',
                'Разработаны стандарты рабочих мест; состояние рабочих мест поддерживается в соответствии со стандартами. Определена процедура периодического пересмотра и актуализации стандартов. Актуализация производится своевременно.',
                'На производстве визуализированы опасные зоны, движущиеся механизмы, выделены безопасные зоны для персонала.',
                'Введена система, позволяющая вести постоянный контроль выполнения производственного плана (почасовой, пооперационный, попозиционный и т.п.). Отклонения от плана фиксируются, по отклонениям разрабатываются и реализуются корректирующие мероприятия.',
                'Технологическое оборудование автоматически останавливается при обнаружении неисправности и несоответствия для недопущения производства брака.',
                'Используется система автоматического оповещения об остановках производства (поломка и остановка оборудования, отсутствие материалов и т.п.).',
                'Используемые в обществе технологии и оборудование соответствуют наиболее высокому уровню технологического развития в отрасли, в том числе в мировой практике.',

                'Ведется учет дефектов материалов и комплектующих от внешнего поставщика; проводится работа с внешними поставщиками по снижению уровня дефектности; динамика снижения количества дефектов положительная (количество дефектов / рекламаций снижается, либо равно нулю).',
                'Ведется учет дефектов, выявленных в процессе собственного производства; производится поиск первопричин появления дефектов в процессе собственного производства, разрабатываются и реализуются корректирующие мероприятия, проверяется результативность мероприятий; динамика снижения количества дефектов положительная (количество дефектов снижается, либо равно нулю).',
                'Ведется учет собственных затрат на исправление дефектов. Динамика снижения затрат на исправление дефектов положительна.',
                'Контрольные операции в производственном потоке проводятся на каждом изделии отдельно, без накопления партии и без остановки производственного процесса.',
                'Контрольные операции, которые невозможно встроить в процесс производства, стандартизированы; проведена оптимизация времени проведения контрольных операций.',
                'Ведется учет дефектов готовой продукции, поступивших в порядке рекламации от заказчика; производится поиск первопричин появления дефектов готовой продукции, разрабатываются и реализуются корректирующие мероприятия, проверяется результативность мероприятий; динамика количества рекламаций положительная (количество рекламаций снижается, либо равно нулю).'
            ],
            'standard' => [
                '1,00 - стратегия утверждена руководителем предприятия; стратегия актуальна на дату аудита<br>0 - стратегия отсутствует или не актуальна',
                '1,00 - регламентирующие документы утверждены и актуальны; все предусмотренные мероприятия выполняются в срок<br>0,75 - регламентирующие документы утверждены и актуальны; больше 50% мероприятий выполняются в срок<br>0,50 - регламентирующие документы утверждены и актуальны; менее 50% мероприятий выполняются в срок<br>0,25 - в наличии и актуален только один регламентирующий документ (по управлению эффективностью или по ПТ)<br>0 - регламентирующие документы отсутствуют или не актуальны',
                '1,00 - цели по повышению эффективности и ПТ на год установлены; цели соответствуют утвержденной стратегии развития ПС; цели декомпозированы до уровня руководителей подразделений; премирование руководителей включает критерий достижения целей по повышению эффективности и ПТ<br>0,75 - цели по повышению эффективности и ПТ на год установлены; цели соответствуют утвержденной стратегии развития ПС; цели декомпозированы до уровня руководителей подразделений<br>0,50 - цели по повышению эффективности и ПТ на год установлены на уровне предприятия; цели соответствуют утвержденной стратегии развития ПС, но до уровня руководителей подразделений не декомпозированы <br>0,25 - цели по повышению эффективности и ПТ на год установлены на уровне предприятия; цели утвержденной стратегии развития ПС не соответствуют и до уровня руководителей подразделений не декомпозированы<br>0 - цели по повышению эффективности и ПТ не устанавливаются',
                '1,00 - план проектов / мероприятий по повышению эффективности разработан и утвержден на год; мероприятия из плана выполняются в срок в полном объеме<br>0,75 - план проектов / мероприятий по повышению эффективности разработан и утвержден на год; больше 80% мероприятий выполняются в срок <br>0,50 - план проектов / мероприятий по повышению эффективности разработан и утвержден на год; больше 50% мероприятий выполняются в срок<br>0,25 - план проектов / мероприятий по повышению эффективности разработан и утвержден; выполняются в срок только отдельные мероприятия <br>0 - планирование проектов и мероприятий по повышению эффективности не осуществляется',
                '1,00 - утверждено положение о подразделении, утверждены должностные инструкции, сотрудники приняты в штат и выполняют свои должностные обязанности в полном объеме<br>0,50 - утверждено положение о подразделении, утверждены должностные инструкции, сотрудники в штат не приняты<br>0 - подразделение не сформировано, сотрудники не назначены',
                '1,00 - орган, наделенный полномочиями по управлению эффективностью и управлению ПТ, сформирован под председательством генерального директора; проводятся периодические совещания, решения фиксируются в распорядительных документах<br>0,75 - орган, наделенный полномочиями по управлению эффективностью и управлению ПТ, сформирован под председательством генерального директора; проводятся периодические совещания, решения не фиксируются в распорядительных документах<br>0,50 - орган, наделенный полномочиями по управлению эффективностью и управлению ПТ, сформирован под председательством генерального директора; проводятся периодические совещания, решения совещаний не фиксируются и не исполняются<br>0,25 - орган, наделенный полномочиями по управлению эффективностью и управлению ПТ, сформирован, но ГД не под председательством ГД<br>0 - орган, наделенный полномочиями по управлению эффективностью и управлению ПТ, не сформирован',
                '1,00 - введен в действие нормативный документ, описывающий систему подачи и реализации предложений по улучшению процессов от рабочего персонала; рассмотрение предложений работников проводится в установленном порядке; один сотрудник предприятия подает не менее одного предложения в год<br>0,75 - введен в действие нормативный документ, описывающий систему подачи и реализации предложений по улучшению процессов от рабочего персонала; рассмотрение предложений работников проводится в установленном порядке<br>0,50 - введен в действие нормативный документ, описывающий систему подачи и реализации предложений по улучшению процессов от рабочего персонала; рассмотрение предложений работников проводится с нарушением установленного порядка<br>0,25 - введен в действие нормативный документ, описывающий систему подачи и реализации предложений по улучшению процессов от рабочего персонала <br>0 - система подачи и реализации предложений по улучшению процессов от рабочего персонала не функционирует',
                '1,00 - разработан и введен в действие регламентирующий документ по мотивации персонала за участие в разработке и реализации проектов / мероприятий по повышению эффективности процессов; документ включает как материальные, так и нематериальные виды мотивации; размер мотивации зависит от полученного экономического эффекта; вознаграждение персонала производится регулярно в соответствии с установленными правилами<br>0,75 - разработан и введен в действие регламентирующий документ по мотивации персонала за участие в разработке и реализации проектов / мероприятий по повышению эффективности процессов; документ включает как материальные, так и нематериальные виды мотивации; размер мотивации зависит от полученного экономического эффекта<br>0,50 - разработан и введен в действие регламентирующий документ по мотивации персонала за участие в разработке и реализации проектов / мероприятий по повышению эффективности процессов; документ включает как материальные, так и нематериальные виды мотивации<br>0,25 - регламентирующий документ по мотивации персонала за участие в разработке и реализации проектов / мероприятий по повышению эффективности утвержден<br>0 - регламентирующий документ по мотивации персонала за участие в разработке и реализации проектов / мероприятий по повышению эффективности процессов не разработан и не утвержден',
                '1,00 - повышение эффективности процессов осуществляется во всех вспомогательных подразделениях<br>0,75 - повышение эффективности процессов осуществляется более чем в 50% вспомогательных подразделений<br>0,50 - повышение эффективности процессов осуществляется менее чем в 50% вспомогательных подразделений<br>0,25 - реализован пилотный проект по повышению эффективности процессов во вспомогательном подразделении<br>0 - повышение эффективности вспомогательных процессов не производится',
                '1,00 - разработан нормативный документ, описывающий систему визуального управления; система визуального управления внедрена во всех подразделениях<br>0,75 - разработан нормативный документ, описывающий систему визуального управления; система визуального управления внедрена менее, чем в 50% подразделений<br>0,50 - разработан нормативный документ, описывающий систему визуального управления; реализован пилотный проект с применением системы визуального управления<br>0,25 - разработан нормативный документ, описывающий систему визуального управления<br>0 - визуальное управление не применяется',
                '1,00 - динамика изменения эффективности производства и ПТ положительная<br>0 - динамика изменения эффективности производства и ПТ отрицательная',
                '1,00 - обходы подразделений высшим менеджментом проводятся регулярно, решения в распорядительных документах фиксируются, осуществляется отслеживание исполнения решений, при отклонении от плана мероприятий реализуются корректирующие мероприятия<br>0,75 - обходы подразделений высшим менеджментом проводятся регулярно, решения в распорядительных документах фиксируются, осуществляется отслеживание исполнения решений, при отклонении от плана мероприятий производится перенос сроков<br>0,50 - обходы подразделений высшим менеджментом проводятся регулярно, решения по мероприятиям в распорядительных документах фиксируются<br>0,25 - обходы подразделений высшим менеджментом проводятся не регулярно, решения по мероприятиям в распорядительных документах не фиксируются<br>0 - обходы подразделений высшим менеджментом не проводятся',

                '1,00 - процедура планирования персонала по количеству и составу профессий под выполнение производственной программы утверждена и актуальна; планирование персонала по количеству и составу профессий проводится регулярно; фактическая численность персонала соответствует плановой; реализуются мероприятия по оптимизации численности персонала<br>0,75 - процедура планирования персонала по количеству и составу профессий под выполнение производственной программы утверждена и актуальна; планирование персонала по количеству и составу профессий проводится регулярно; фактическая численность персонала соответствует плановой<br>0,50 - процедура планирования персонала по количеству и составу профессий под выполнение производственной программы утверждена и актуальна; планирование персонала по количеству и составу профессий проводится регулярно<br>0,25 - процедура планирования персонала по количеству и составу профессий под выполнение производственной программы утверждена и актуальна<br>0 - процедура планирования персонала под выполнение производственной программы отсутствует',
                '1,00 - утвержден нормативный документ, описывающий систему управления трудоемкостью работ; нормы трудоемкости устанавливаются на основании нормативных документов; работы закрываются по нормативам; выявлена положительная динамика изменения трудоемкости<br>0,75 - утвержден нормативный документ, описывающий систему управления трудоемкостью работ; нормы трудоемкости устанавливаются на основании нормативных документов; работы закрываются по нормативам<br>0,50 - утвержден нормативный документ, описывающий систему управления трудоемкостью работ; нормы трудоемкости устанавливаются на основании нормативных документов<br>0,25 - утвержден нормативный документ, описывающий систему управления трудоемкостью работ<br>0 - система управления трудоемкостью работ не сформирована',
                '1,00 - навыки персонала, необходимые для выполнения операций, определяются и фиксируются в документах; производится оценка фактических навыков персонала, выявляются «узкие» навыки; проводится обучение персонала навыкам, имеются подтверждающие документы; в подразделениях отсутствуют работники с «узкими» навыками (т.е. отсутствуют навыки, которыми обладают 1-2 работника)<br>0,75 - навыки персонала, необходимые для выполнения операций, определяются и фиксируются в документах; производится оценка фактических навыков персонала, выявляются «узкие» навыки; проводится обучение персонала навыкам, имеются подтверждающие документы<br>0,50 - навыки персонала, необходимые для выполнения операций, определяются и фиксируются в документах; производится оценка фактических навыков персонала, выявляются «узкие» навыки<br>0,25 - навыки персонала, необходимые для выполнения операций, определяются и фиксируются в документах <br>0 - навыки персонала не определяются',
                '1,00 - программы обучения персонала инструментам повышения эффективности (бережливого производства) разработаны и утверждены<br>0 - программы обучения отсутствуют',
                '1,00 - в систему обучения и повышения квалификации персонала встроено обучение инструментам повышения эффективности (бережливого производства)<br>0 - обучение инструментам повышения эффективности (бережливого производства) в систему обучения и повышения квалификации не встроено',
                '1,00 - проводится анализ загрузки и эффективности работы персонала; разрабатываются мероприятия по повышению загрузки и эффективности работы персонала; все мероприятия выполняется в срок; динамика загрузки и эффективности персонала положительная<br>0,75 - проводится анализ загрузки и эффективности работы персонала; разрабатываются мероприятия по повышению загрузки и эффективности работы персонала; все мероприятия выполняется в срок<br>0,50 - проводится анализ загрузки и эффективности работы персонала; разрабатываются мероприятия по повышению загрузки и эффективности работы персонала; менее 50% мероприятий выполняется в срок<br>0,25 - проводится анализ загрузки и эффективности работы персонала; разрабатываются мероприятия по повышению загрузки и эффективности работы персонала<br>0 - анализ загрузки и эффективности работы персонала не проводится',
                '1,00 - утвержден нормативный документ, описывающий механизм быстрой перебалансировки работ между производственным персоналом при изменении объемов производства; осуществляется мониторинг текущей загрузки персонала; производится перебалансировка работ, в том числе с привлечением вспомогательного персонала; при перебалансировке не происходит остановка процесса производства<br>0,75 - утвержден нормативный документ, описывающий механизм быстрой перебалансировки работ между производственным персоналом при изменении объемов производства; осуществляется мониторинг текущей загрузки персонала; производится перебалансировка работ, в том числе с привлечением вспомогательного персонала<br>0,50 - утвержден нормативный документ, описывающий механизм быстрой перебалансировки работ между производственным персоналом при изменении объемов производства; осуществляется мониторинг текущей загрузки персонала<br>0,25 - утвержден нормативный документ, описывающий механизм быстрой перебалансировки работ между производственным персоналом при изменении объемов производства<br>0 - механизм быстрой перебалансировки работ отсутствует',

                '1,00 - оборудования в потоке, которое является критическим для выполнения производственного плана, определен; утвержден документом<br>0 - перечень оборудования не определен',
                '1,00 - стандарты, инструкции по периодическому обслуживанию оборудования (например, плановое обслуживание, обслуживание оператором и т.п.) утверждены ответственным руководителем предприятия; размещены на рабочих местах; операторы (рабочие) с инструкциями ознакомлены; требования стандартов, инструкций соблюдаются в полном объеме<br>0,75 - стандарты, инструкции по периодическому обслуживанию оборудования (например, плановое обслуживание, обслуживание оператором и т.п.) утверждены ответственным руководителем предприятия; размещены на рабочих местах; операторы (рабочие) с инструкциями ознакомлены<br>0,50 - стандарты, инструкции по периодическому обслуживанию оборудования (например, плановое обслуживание, обслуживание оператором и т.п.) утверждены ответственным руководителем предприятия; размещены на рабочих местах<br>0,25 - стандарты, инструкции по периодическому обслуживанию оборудования (например, плановое обслуживание, обслуживание оператором и т.п.) утверждены ответственным руководителем предприятия<br>0 - стандарты, инструкции по периодическому обслуживанию оборудования отсутствуют',
                '1,00 - утверждена методика оценки эффективности использования оборудования; проводится фиксация простоев или расчет показателя эффективности; разрабатываются мероприятия по снижению простоев или повышению эффективности оборудования; динамика снижения простоев или повышения показателя эффективности положительная<br>0,75 - утверждена методика оценки эффективности использования оборудования; проводится фиксация простоев или расчет показателя эффективности; разрабатываются мероприятия по снижению простоев или повышению эффективности оборудования<br>0,50 - утверждена методика оценки эффективности использования оборудования; проводится фиксация простоев или расчет показателя эффективности<br>0,25 - утверждена методика оценки эффективности использования оборудования<br>0 - оценка эффективности использования оборудования не проводится',
                '1,00 - установлен норматив времени на переналадку; время переналадки присутствует в производственном плане; длительность переналадки разбита на этапы, зафиксирована документально; периодически проводится анализ этапов переналадки, разрабатываются и реализуются мероприятия по сокращению длительности переналадки; наилучший способ переналадки зафиксирован в стандарте, работники со стандартом ознакомлены и соблюдают его<br>0,75 - установлен норматив времени на переналадку; время переналадки присутствует в производственном плане; длительность переналадки разбита на этапы, зафиксирована документально; периодически проводится анализ этапов переналадки, разрабатываются и реализуются мероприятия по сокращению длительности переналадки <br>0,50 - установлен норматив времени на переналадку; время переналадки присутствует в производственном плане; длительность переналадки разбита на этапы, зафиксирована документально<br>0,25 - установлен норматив времени на переналадку, время переналадки присутствует в производственном плане<br>0 - процесс перехода с одного вида продукции на другой (переналадка) не анализируется',
                '1,00 - функционирует единый центр мониторинга работы критического оборудования во всех подразделениях с оборудованием; реализованы функции отображения состояния оборудования в режиме реального времени, автоматического вызова ремонтных служб и оповещения ответственных руководителей предприятия<br>0,75 - функционирует единый центр мониторинга работы критического оборудования в пилотном подразделении; реализованы функции отображения состояния оборудования в режиме реального времени, автоматического вызова ремонтных служб и оповещения ответственных руководителей предприятия<br>0,50 - функционирует единый центр мониторинга работы критического оборудования в пилотном подразделении; реализованы функции отображения состояния оборудования в режиме реального времени и автоматического вызова ремонтных служб<br>0,25 - функционирует единый центр мониторинга работы критического оборудования в пилотном подразделении; реализована функция отображения состояния оборудования в режиме реального времени<br>0 - единый центр мониторинга работы критического оборудования отсутствует',

                '1,00 - места хранения ТМЦ на складе определены и визуализированы; используется система адресного хранения; определены нормативы объема ТМЦ на складах; установлены правила пополнения ТМЦ<br>0,75 - места хранения ТМЦ на складе определены и визуализированы; используется система адресного хранения; определены нормативы объема ТМЦ на складах<br>0,50 - места хранения ТМЦ на складе определены и визуализированы; используется система адресного хранения<br>0,25 - места хранения ТМЦ на складе определены и визуализированы<br>0 - управление ТМЦ на складах не проводится',
                '1,00 - стандартами установлены маршруты транспортировки ТМЦ со складов; определены виды транспортировки; установлен порядок транспортировки; правила транспортировки соблюдаются<br>0,75 - стандартами установлены маршруты транспортировки ТМЦ со складов; определены виды транспортировки; установлен порядок транспортировки<br>0,50 - стандартами установлены маршруты транспортировки ТМЦ со складов; определены виды транспортировки<br>0,25 - стандартами установлены маршруты транспортировки ТМЦ со складов<br>0 - правила транспортировки ТМЦ со складов не установлены',
                '1,00 - места хранения НЗП в производстве определены и визуализированы; используется система адресного хранения; определены нормативы объема НЗП; установлены правила пополнения НЗП (материалов и комплектующих)<br>0,75 - места хранения НЗП в производстве определены и визуализированы; используется система адресного хранения; определены нормативы объема НЗП<br>0,50 - места хранения НЗП в производстве определены и визуализированы; используется система адресного хранения<br>0,25 - места хранения НЗП в производстве определены и визуализированы<br>0 - управление НЗП в производстве не проводится',
                '1,00 - стандартами установлены маршруты транспортировки НЗП в производстве; определены виды транспортировки; установлен порядок транспортировки; правила транспортировки соблюдаются<br>0,75 - стандартами установлены маршруты транспортировки НЗП в производстве; определены виды транспортировки; установлен порядок транспортировки<br>0,50 - стандартами установлены маршруты транспортировки НЗП в производстве; определены виды транспортировки<br>0,25 - стандартами установлены маршруты транспортировки НЗП в производстве<br>0 - правила транспортировки НЗП в производстве не установлены',
                '1,00 - перемещение НЗП (материалов, комплектующих, полуфабрикатов, продукции и т.п.) в производстве осуществляется по принципу «вытягивания» - транспортировка осуществляется только по требованию заказчика<br>0 - перемещение НЗП (материалов, комплектующих, полуфабрикатов, продукции и т.п.) в производстве осуществляется по принципу «выталкивания» - транспортировка осуществляется после изготовления вне зависимости от потребности следующего рабочего места',
                '1,00 - поставка материалов и комплектующих на рабочие места осуществляется своевременно, простои производства из-за отсутствия материалов и комплектующих отсутствуют<br>0,50 - в местах хранения материалов и комплектующих осуществляется контроль остатков; присутствуют простои производства из-за отсутствия материалов и комплектующих<br>0 - поставка материалов и комплектующих на рабочие места осуществляется с задержками, вызывая ожидание производственного процесса',
                '1,00 - при выдаче материалов и комплектующих применяются принципы FIFO, FEFO<br>0 - принципы очередности при выдаче материалов и комплектующих отсутствуют',
                '1,00 - произведен расчет производственного, буферного и страхового запасов; уровень НЗП в потоке анализируется, наблюдается положительная динамика снижения запасов<br>0 - расчет запасов не производится, изменение запасов не анализируется',
                '1,00 - простои по отсутствию материалов и комплектующих фиксируются, разрабатываются мероприятия по снижению простоев; все мероприятия реализуются в срок; наблюдается положительная динамика снижения простоев<br>0,75 - простои по отсутствию материалов и комплектующих фиксируются, разрабатываются мероприятия по снижению простоев; все мероприятия реализуются в срок<br>0,50 - простои по отсутствию материалов и комплектующих фиксируются, разрабатываются мероприятия по снижению простоев<br>0,25 - простои по отсутствию материалов и комплектующих фиксируются, мероприятия по снижению простоев не разрабатываются<br>0 - в производстве наблюдаются простои по отсутствию материалов и комплектующих, но не фиксируются',

                '1,00 - производственная способность предприятия обеспечивает выполнение производственной программы, что подтверждается соответствующими расчетами<br>0,50 - расчеты производственной способности предприятия проводятся, но производственная способность предприятия не обеспечивает выполнение производственной программы<br>0 - расчеты производственной способности предприятия не проводятся',
                '1,00 - осуществляется номенклатурное планирование<br>0 - осуществляется только объемное планирование',
                '1,00 - производство на каждом этапе запускается при возникновении потребности на следующем переделе (производство основано на принципе «вытягивания»)<br>0 - производство на каждом этапе запускается при наличии документации и материалов',
                '1,00 - строятся карты материальных и информационных потоков; выявляются «узкие» места; разрабатываются и реализуются мероприятия по повышению эффективности производства<br>0,75 - строятся карты материальных и информационных потоков; выявляются «узкие» места<br>0,50 - строятся карты материальных и информационных потоков<br>0,25 - строятся карты материальных потоков<br>0 - материальные и информационные потоки не анализируются',
                '1,00 - в производстве и в офисе организовано более одного эталонного (образцового) участка с применением принципов и инструментов производственной системы (бережливого производства); эталонные (образцовые) участки используются при проведении практического обучения инструментам повышения эффективности (бережливого производства)<br>0,75 - эталонные (образцовые) участки используются при проведении практического обучения инструментам повышения эффективности (бережливого производства)<br>0,50 - в производстве и в офисе организовано по одному эталонному (образцовому) участку с применением принципов и инструментов производственной системы (бережливого производства)<br>0,25 - в производстве организован один эталонный (образцовый) участок с применением принципов и инструментов производственной системы (бережливого производства)<br>0 - эталонные (образцовые) участки отсутствуют',
                '1,00 - утверждена процедура организации и стандартизации рабочих мест; стандарты рабочих мест разработаны; сотрудники со стандартами рабочих мест ознакомлены и соблюдают их; актуализация стандартов проводится в соответствии с установленной периодичностью<br>0,75 - утверждена процедура организации и стандартизации рабочих мест; стандарты рабочих мест разработаны; сотрудники со стандартами рабочих мест ознакомлены и соблюдают их<br>0,50 - утверждена процедура организации и стандартизации рабочих мест; стандарты рабочих мест разработаны<br>0,25 - утверждена процедура организации и стандартизации рабочих мест<br>0 - стандарты рабочих мест отсутствуют',
                '1,00 - утвержден стандарт по визуализации опасных зон, движущихся механизмов, безопасных зон для персонала на производстве; визуализированы основные и вспомогательные (ремонтные службы, инструментальные участки и т.п.) производственные подразделения; требования визуализации соблюдаются, что подтверждается результатами проверок<br>0,75 - утвержден стандарт по визуализации опасных зон, движущихся механизмов, безопасных зон для персонала на производстве; визуализированы основные и вспомогательные (ремонтные службы, инструментальные участки и т.п.) производственные подразделения<br>0,50 - утвержден стандарт по визуализации опасных зон, движущихся механизмов, безопасных зон для персонала на производстве; визуализированы основные производственные подразделения<br>0,25 - утвержден стандарт по визуализации опасных зон, движущихся механизмов, безопасных зон для персонала на производстве<br>0 - визуализация на производстве не используется',
                '1,00 - введена система контроля выполнения производственного плана, утверждена документально; отклонения от выполнения плана фиксируются в соответствии с установленной периодичностью, по отклонениям реализуются корректирующие мероприятия; все мероприятия реализуются в установленные сроки; месячный план производства выполняется в полном объеме<br>0,75 - введена система контроля выполнения производственного плана, утверждена документально; отклонения от выполнения плана фиксируются в соответствии с установленной периодичностью, по отклонениям реализуются корректирующие мероприятия; все мероприятия реализуются в установленные сроки<br>0,50 - введена система контроля выполнения производственного плана, утверждена документально; отклонения от выполнения плана фиксируются в соответствии с установленной периодичностью, по отклонениям реализуются корректирующие мероприятия<br>0,25 - введена система контроля выполнения производственного плана, утверждена документально<br>0 - контроль выполнения производственного плана не проводится',
                '1,00 - технологическое оборудование автоматически останавливается при обнаружении неисправности и несоответствия для недопущения производства брака<br>0 - система автоматической остановки оборудования при обнаружении неисправности и несоответствия для недопущения производства брака отсутствует',
                '1,00 - используется система оповещения об остановках производства (поломка и остановка оборудования, отсутствие материалов и т.п.)<br>0 - система автоматического оповещения об остановках производства отсутствует',
                '1,00 - используемые в обществе технологии и оборудование соответствуют наиболее высокому уровню технологического развития в отрасли, в том числе в мировой практике<br>0 - технологии и оборудование, используемые в обществе, не соответствуют наиболее высокому уровню технологического развития в отрасли, в том числе в мировой практике',

                '1,00 - ведется учет дефектов материалов и комплектующих от внешнего поставщика; статистика по дефектам направляется поставщику; совместно с поставщиком разрабатываются мероприятия по снижению количества дефектов; динамика снижения количества дефектов положительная (количество дефектов / рекламаций снижается, либо равно нулю)<br>0,75 - ведется учет дефектов материалов и комплектующих от внешнего поставщика; статистика по дефектам направляется поставщику; совместно с поставщиком разрабатываются мероприятия по снижению количества дефектов<br>0,50 - ведется учет дефектов материалов и комплектующих от внешнего поставщика; статистика по дефектам направляется поставщику<br>0,25 - ведется учет дефектов материалов и комплектующих от внешнего поставщика<br>0 - работа по снижению дефектов материалов и комплектующих от внешнего поставщика не проводится',
                '1,00 - ведется учет дефектов, выявленных в процессе собственного производства; с помощью инструментов анализа коренных причин производится поиск первопричин появления дефектов в процессе собственного производства, разрабатываются и реализуются корректирующие мероприятия; проверяется результативность мероприятий; динамика снижения количества дефектов положительная (количество дефектов снижается, либо равно нулю)<br>0,75 - ведется учет дефектов, выявленных в процессе собственного производства; с помощью инструментов анализа коренных причин производится поиск первопричин появления дефектов в процессе собственного производства, разрабатываются и реализуются корректирующие мероприятия; проверяется результативность мероприятий<br>0,50 - ведется учет дефектов, выявленных в процессе собственного производства; с помощью инструментов анализа коренных причин производится поиск первопричин появления дефектов в процессе собственного производства, разрабатываются и реализуются корректирующие мероприятия<br>0,25 - ведется учет дефектов, выявленных в процессе собственного производства<br>0 - работа по снижению дефектов не проводится',
                '1,00 - учет собственных затрат на исправление дефектов ведется; разрабатываются мероприятия по снижению затрат на исправление дефектов; все мероприятия реализуются в срок; динамика снижения затрат на исправление дефектов положительна<br>0,75 - учет собственных затрат на исправление дефектов ведется; разрабатываются мероприятия по снижению затрат на исправление дефектов; более 50% мероприятий реализуется в срок <br>0,50 - учет собственных затрат на исправление дефектов ведется; разрабатываются мероприятия по снижению затрат на исправление дефектов; менее 50% мероприятий реализуется в срок<br>0,25 - учет собственных затрат на исправление дефектов ведется<br>0 - учет собственных затрат на исправление дефектов не ведется',
                '1,00 - контрольные операции в производственном потоке проводятся без остановки производственного процесса; на каждом изделии отдельно без накопления партии; критерии годной продукции и дефектов определены, на рабочих местах размещена визуализация качественной продукции и основных видов дефектов<br>0,75 - контрольные операции в производственном потоке проводятся без остановки производственного процесса; на каждом изделии отдельно без накопления партии<br>0,50 - контрольные операции в производственном потоке проводятся без остановки производственного процесса, но в объеме партии<br>0,25 - контрольные операции в производственном потоке проводятся, но с остановкой производственного процесса<br>0 - контрольные операции в производственном потоке не проводятся',
                '1,00 - проведен хронометраж контрольных операций, не встроенных в процесс, установлены нормативы времени; разработаны стандарты проведения контрольных операций, в том числе с визуализацией видов дефектов; работники, задействованные в контрольных операциях, ознакомлены со стандартами и соблюдают их; периодически проводится оптимизация контрольных операций со снижением времени и актуализация стандартов<br>0,75 - проведен хронометраж контрольных операций, не встроенных в процесс, установлены нормативы времени; разработаны стандарты проведения контрольных операций, в том числе с визуализацией видов дефектов; работники, задействованные в контрольных операциях, ознакомлены со стандартами и соблюдают их<br>0,50 - проведен хронометраж контрольных операций, не встроенных в процесс, установлены нормативы времени; разработаны стандарты проведения контрольных операций, в том числе с визуализацией видов дефектов<br>0,25 - проведен хронометраж контрольных операций, не встроенных в процесс, установлены нормативы времени<br>0 - контрольные операции, не встроенные в процесс, не стандартизированы',
                '1,00 - ведется учет дефектов готовой продукции, поступивших в порядке рекламации от заказчика; с помощью инструментов анализа коренных причин производится поиск первопричин появления дефектов, разрабатываются и реализуются корректирующие мероприятия; проверяется результативность мероприятий; динамика снижения количества дефектов положительная (количество дефектов снижается, либо равно нулю)<br>0,75 - ведется учет дефектов готовой продукции, поступивших в порядке рекламации от заказчика; с помощью инструментов анализа коренных причин производится поиск первопричин появления дефектов, разрабатываются и реализуются корректирующие мероприятия; проверяется результативность мероприятий<br>0,50 - ведется учет дефектов готовой продукции, поступивших в порядке рекламации от заказчика; с помощью инструментов анализа коренных причин производится поиск первопричин появления дефектов, разрабатываются и реализуются корректирующие мероприятия<br>0,25 - ведется учет дефектов готовой продукции, поступивших в порядке рекламации от заказчика<br>0 - работа по снижению количества дефектов не проводится'
            ],
            'weights' => [
                2, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1,
                2, 1, 1, 1, 1, 1, 2,
                1, 1, 2, 1, 2,
                1, 1, 1, 1, 1, 2, 1, 1, 2,
                2, 2, 1, 1, 1, 1, 1, 2, 1, 1, 1,
                1, 2, 1, 2, 1, 1
            ],
            'custommarks' => [
                [0, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.5, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 1],
                [0, 0.25, 0.5, 0.75, 1],

                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 1],
                [0, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],

                [0, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],

                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 1],
                [0, 0.5, 1],
                [0, 1],
                [0, 1],
                [0, 0.25, 0.5, 0.75, 1],

                [0, 0.5, 1],
                [0, 1],
                [0, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 1],
                [0, 1],
                [0, 1],

                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1],
                [0, 0.25, 0.5, 0.75, 1]
            ]
        ],
        3 => [
            'title' => 'Разработка и постановка на производство',
            'categories' => [
                [
                    'Обеспечение разработки',
                    'Процесс разработки',
                    'Конструкторская документация. Управление конструкторской документацией.',
                    'Постановка продукции на производство'
                ],
                [
                    [0, 1, 2, 3],
                    [4, 5, 6, 7, 8, 9],
                    [10, 11],
                    [12, 13, 14, 15]
                ]
            ],
            'criteria' => [
                'Разработан, внедрен регламент процесса проектирования и разработки. Поддерживается взаимодействие со смежными бизнес-процессами.',
                'Наличие у предприятия опыта разработки выпускаемой продукции.',
                'Наличие  ресурсной базы для проведения научно-исследовательских работ (НИР).',
                'Наличие ресурсной базы для проведения опытно-конструкторских работ (ОКР).',

                'В наличии и актуальна программа обеспечения надежности разработки продукции (соответствует требованиям ГОСТ РВ 0027-102) или программа обеспечения качества (соответствует требованиям ГОСТ РВ 52375).',
                'Установлен порядок разработки и контроля выполнения планов совместных работ с внешними поставщиками на всех уровнях кооперации (план-графиков, сетевых план-графиков, единых сквозных планов) (при наличии) в соответствии с ГОСТ РВ 15.208.',
                'Устанавливаемые в разрабатываемой документации (ТУ,ТД, ПМ) технические характеристики продукции, состав и последовательность проведения испытаний, критерии приемки и забракования продукции и т.п. обеспечивают контроль соблюдения требований к продукции, установленных в ТЗ.',
                'Анализ результатов выполнения НИР и ОКР проводится на всех этапах их выполнения и рассматривается на заседаниях НТС. В отношении разрабатываемой продукции в обеспечение ГОЗ, результаты анализа рассматриваются с участием ВП МО РФ (при их согласии).',
                'Наличие, актуальность, выполнение процедуры по контролю качества разработки (нормоконтроль, технологическая и метрологическая экспертиза КД).',
                'Наличие, актуальность и выполнение  документированной процедуры по авторскому надзору в процессе производства и при  эксплуатации выпускаемой продукции.',

                'Наличие, актуальность, выполнение документированной процедуры по утверждению документации на серийную продукцию и присвоению литеры.',
                'Наличие полного комплекта конструкторской документации с литерой, утвержденной заказчиком (чертежи, ТУ, ЭД).',

                'Разработан, внедрен регламент процесса постановки продукции на производство. Поддерживается взаимодействие со смежными бизнес-процессами. Регламент учитывает требования ГОСТ Р 15.301 и ГОСТ РВ 0015-301 (для продукции, изготавливаемой в обеспечение ГОЗ).',
                'Разработан и актуализируется перечень (перечни) специальных и особо ответственных технологических процессов (операций). Технологические процессы содержат информацию о ключевых характеристиках данных процессов и сформированы на основе рассмотрения рисков.',
                'Осуществляется рассмотрение, документирование и управление  рисками и возможностями процессов проектирования и постановки на производство. Меры, принимаемые в отношении рисков и возможностей пропорциональны их возможному влиянию на соответствие продукции и услуг.',
                'Определены параметры характеристики технологических процессов, подлежащих контролю и измерениям.'
            ],
            'standard' => [
                '4.4, 8.3.1 (4.4.3, 8.3)',
                'Требование ОСК',
                '8.3.2, 8.3.4 (8.3.2, 8.3.4)',
                '8.3.2, 8.3.4 (8.3.2, 8.3.4)',

                '(8.3.3.2, 8.3.4.8)',
                '(8.3.2.5)',
                '8.3.2 (8.3.2.8)',
                '8.3.4 (8.3.4.3, 8.3.4.4)',
                '8.3.4 (8.3.4.8)',
                '8.3.6 (8.3.6)',

                '8.3.5 (8.3.5)',
                '8.3.6 (8.3.6)',

                '4.4, 8.5.1 (8.5.1)',
                '8.5.1 (8.3.2.7, 8.5.1.3 б)',
                '6.1.2 (6.1.3)',
                '8.5.1 (8.5.1.3 г)'
            ],
            'weights' => [
                2, 1, 1, 1,
                1, 1, 1, 1, 1, 1,
                1, 1,
                2, 1, 1, 1
            ],
            'custommarks' => []
        ],
        4 => [
            'title' => 'Технология',
            'categories' => [
                [
                    'Управление технологическими процессами',
                    'Технологическая  документация. Управление технологической документацией.',
                    'Разработка и управление средствами технологического оснащения.',
                    'Соблюдение технологической дисциплины на производстве',
                    'Особо ответственные технологические процессы (операции)',
                    'Специальные технологические процессы.'
                ],
                [
                    [0, 1],
                    [2, 3, 4],
                    [5, 6],
                    [7, 8],
                    [9, 10],
                    [11, 12]
                ]
            ],
            'criteria' => [
                'Разработан, внедрен регламент процесса управления технологическими процессами. Поддерживается взаимодействие со смежными бизнес-процессами.',
                'Наличие у предприятия опыта разработки и внедрения технологических процессов.',

                'Наличие, актуальность, выполнение документированной процедуры по утверждению технологической документации на серийную продукцию и присвоению литеры или аттестации техпроцессов РМРС, «Прометей» и пр. <br>Наличие полного комплекта технологической документации с литерой, утвержденной заказчиком.',
                'Наличие, актуальность, выполнение документированной процедуры по управлению технологической документацией (учет, хранение, дублирование, внесение изменений). ',
                'Изменения в ТД доводятся до производственных участков.',

                'Наличие необходимых ресурсов (персонал, рабочие места, НД, ПО) для разработки технологической оснастки.',
                'С установленной в предприятии периодичностью определяется потребность в средствах технологического оснащения, обеспечивается их ввод в эксплуатацию, техническое обслуживание и ремонт, консервация (при необходимости) и обновление.',

                'Наличие документированной процедуры по организации контроля соблюдения технологической дисциплины.',
                'Выполнение требований по контролю соблюдения технологической дисциплины (документальное подтверждение проведения контроля, определение показателя уровня технологической дисциплины (определяемой по количеству операций без нарушения технологической дисциплины от общего количества проверенных операций), наличие действий в случае отклонений.',

                'Разработан порядок мониторинга (контроля) особо ответственных технологических процессов.',
                'Проводится аттестация особо ответственных технологических процессов (операций) (при наличии).',

                'Разработан порядок мониторинга (контроля) специальных технологических процессов.<br>К специальным технологическим процессам относятся:<br>– сварка;<br>– пайка;<br>– наплавка;<br>– литье;<br>– термообработка;<br>– нанесение покрытий (гальваническое, напыление,  лакокрасочное и т.п.).',
                'Проводится аттестация специальных технологических процессов (при наличии).'
            ],
            'standard' => [
                '4.4, 8.1, 8.5.1 (8.1.2, 8.5.1)',
                'Требование ОСК',

                '8.5.1 (8.5.1.10)',
                '7.5.3 (7.5.3)',
                '8.5.6 (8.5.6, 7.3.2)',

                '7.1.1 (7.1.1)',
                '8.5.1 (8.5.1.3 д)',

                '8.5.1 (8.5.1.9 к)',
                '8.5.1 (8.5.1.11)',

                '8.5.1 (8.5.1.2 в)',
                '8.5.1 (8.5.1.9 в)',

                '8.5.1 (8.5.1.2 в)',
                '8.5.1 (8.5.1.9 г)'
            ],
            'weights' => [
                2, 1,
                1, 1, 1,
                1, 1,
                1, 2,
                1, 1,
                1, 1
            ],
            'custommarks' => []
        ],
        5 => [
            'title' => 'СМК',
            'categories' => [
                [
                    'Обеспечение СМК',
                    'Сертификация, одобрение и лицензирование',
                    'Основные документы СМК',
                    'Управление документированной информацией',
                    'Совершенствование действующей СМК',
                    'Мониторинг удовлетворённости потребителя',
                    'Анализ и оценка',
                    'Внутренний аудит'
                ],
                [
                    [0, 1, 2, 3, 4, 5, 6, 7, 8],
                    [9, 10, 11],
                    [12, 13, 14, 15, 16, 17],
                    [18],
                    [19, 20],
                    [21],
                    [22, 23, 24, 25],
                    [26, 27, 28, 29]
                ]
            ],
            'criteria' => [
                'Наличие актуальной организационной и функциональной структуры СМК организации.',
                'Наличие регламентов основных бизнес-процессов СМК организации. Документы содержат входы, выходы, взаимодействие участников процесса (модель процесса и его описание), показатели результативности процессов. ',
                'Наличие актуальных положений о подразделениях организации.',
                'Наличие актуальных должностных и рабочих инструкций.',
                'Наличие выделенного структурного подразделения  (например, службы менеджмента качества), отвечающего за функционирование СМК.',
                'Наличие представителя руководства по СМК, назначенного приказом руководителя организации.',
                'Наличие документированной информации, регламентирующей взаимодействие с ВП (при наличии закрепленного ВП).',
                'Наличие документально оформленного порядка по обеспечению информационной безопасности.',
                'Наличие функционирующего коллегиального органа по качеству (Совет по СМК, Совет по качеству, научно-технический совет, постоянно действующая комиссия по качеству и т.п.). Порядок формирования, задачи, состав, планы работ, форма решения коллегиального органа документированы.',

                'Наличие сертификата /сертификатов соответствия СМК стандарту ГОСТ Р ИСО 9001, ГОСТ РВ 0015-002 для военной продукции, в случае, если предприятие ее производит и /или другим стандартам системы менеджмента качества.',
                'Наличие свидетельств РМРС, РКО: свидетельств о признании, свидетельств о типовом одобрении, свидетельств на производство продукции (обязательно на продукцию для гражданского судостроения).',
                'Наличие необходимых лицензий на выполнение работ по основному виду деятельности.',

                'Наличие актуального, согласованного с ВП, перечня ДСОП, применяемых в организации в соответствии с требованиями ГОСТ РВ 0001-005.',
                'Наличие перечня документов СМК с указанием документации, подлежащей  обязательному согласованию с ВП, по решению ВП.',
                'Наличие актуальной документированной информации (стандартов, регламентов и т.п.).  В организации  применяются учтенные экземпляры действующих ДСОП и другой документированной информации, распространяющихся на выполняемые организацией процессы и виды деятельности.',
                'Наличие и доступность политики в области качества. Установлен порядок разработки, оценки и актуализации политики в области качества, а также порядок доведения до персонала организации и ознакомления заинтересованных сторон.',
                'Наличие утвержденных руководителем организации целей в области качества и мероприятий по их достижению.',
                'Наличие, актуальность Руководства по качеству (включая ссылки на действующие документированные процедуры). Область применения СМК определена (установлена) в Руководстве по качеству. Сведения об исключенных требованиях с указанием причин и обоснования их исключения отражены в Руководстве по качеству.',

                'Наличие, выполнение порядка управления документированной информацией.',

                'Наличие утвержденной руководителем организации программы (плана) создания или изменения области СМК, а также поддержания и совершенствования СМК (ежегодно).',
                'Наличие анализа СМК со стороны высшего руководства. Выходные данные анализа включают в себя решения и действия, относящиеся к возможностям для улучшения, необходимым изменениям СМК, потребности в ресурсах.',

                'Наличие, выполнение актуальной документированной информации  по мониторингу удовлетворенности потребителя (ответственное лицо, методы сбора и анализа информации, оценка результата).',

                'Наличие объективных свидетельств, подтверждающих проведение работ по оценке внешних и внутренних факторов, влияющих на СМК.',
                'Наличие объективных свидетельств, подтверждающих проведение анализа деятельности (работы) внешних организаций (контрагентов) в области качества.',
                'Наличие анализа и оценки результативности действий, предпринятых в отношении рисков и возможностей.',
                'Наличие анализа и оценки результативности процессов СМК.',

                'Наличие актуального документально оформленного порядка проведения внутренних аудитов СМК. ',
                'Наличие актуальной программы внутренних аудитов и документированной информации, подтверждающей проведение внутренних аудитов в соответствии с программой. Наличие информации, подтверждающей выполнение корректирующих действий подразделениями.',
                'Наличие компетентных внутренних аудиторов (наличие документов установленного образца об обучении).',
                'Наличие подтверждения о представлении документированной информации с результатами внутренних аудитов руководителю организации и своевременного доведения до сведения должностных лиц, ответственных за проверяемые процессы.'
            ],
            'standard' => [
                '4.4.1 (4.4.4)',
                '5.3 (4.4.4)',
                '(5.3.7)',
                '(5.3.7)',
                'Требование ОСК',
                '(5.3.2)',
                '(4.4.6)',
                '7.5.3 (7.5.3, 11.3)',
                '(5.3.8, 5.3.9)',

                'Требование ОСК',
                'Требование ОСК (Заказчика) ',
                'Требование ОСК (Заказчика)',

                '(7.5.3.6, а)',
                '(7.5.3.6, б)',
                '7.5.3 (7.5.3.3, 7.5.3.6)',
                '5.2 (5.2)',
                '6.2 (6.2.3, 6.2.4)',
                'Требование ОСК (4.3.2, 4.3.4)',

                '7.5.2, 7.5.3 (7.5.2, 7.5.3)',

                '6.3 (6.3.2)',
                '9.3 (9.3)',

                '5.3, 9.1.2, 9.1.3 (5.3, 9.1.2, 9.1.3)',

                '4.1 (4.1.2)',
                '8.4.2 (8.4.2.6)',
                '9.1.3 e (9.1.3.2 б)',
                '9.1.3 с (9.1.3.2 в)',

                '9.2 (9.2)',
                '9.2.2 (9.2)',
                '7.2, 9.2 (7.2, 9.2)',
                '9.2.2 d (9.2.5)'
            ],
            'weights' => [
                2, 3, 1, 1, 1, 1, 1, 1, 1,
                2, 1, 1,
                1, 1, 2, 1, 1, 1,
                1,
                1, 1,
                2,
                1, 1, 1, 1,
                1, 1, 1, 1
            ],
            'custommarks' => []
        ],
        6 => [
            'title' => 'Контроль качества',
            'categories' => [
                [
                    'Организация работы по обеспечению стабильного качества продукции (работ, услуг)',
                    'Входной контроль',
                    'Контроль качества в процессе производства (операционный контроль)',
                    'Испытания готовой продукции',
                    'Управление техническими средствами для мониторинга и измерения (метрологическое обеспечение)',
                    'Рекламационная работа',
                    'Анализ качества продукции'
                ],
                [
                    [0],
                    [1, 2, 3, 4, 5, 6, 7, 8],
                    [9, 10, 11, 12, 13],
                    [14, 15, 16, 17, 18, 19, 20, 21, 22],
                    [23, 24, 25, 26, 27, 28, 29],
                    [30, 31, 32, 33],
                    [34, 35, 36, 37]
                ]
            ],
            'criteria' => [
                'Наличие структурного подразделения, ответственного за обеспечение технического контроль качества продукции (работ, услуг) на всех этапах (ОКК, ОТК и др.). Фактическая численность ОТК соответствует штатному расписанию.',

                'Наличие персонала (подразделения), ответственного за организацию и проведение входного контроля закупаемой продукции. Персонал, осуществляющий входной контроль, аттестован на соответствие требованиям технологического процесса контроля (для продукции, поставляемой в обеспечение ГОЗ).',
                'Наличие оборудованных и обеспеченных всем необходимым для проведения входного контроля рабочих мест. Рабочие места аттестованы на соответствие требованиям технологического процесса контроля (для продукции, поставляемой в обеспечение ГОЗ).',
                'Наличие,  актуальность и соответствие перечня продукции, подлежащей входному контролю требованиям ГОСТ РВ 0015-308 (для продукции, поставляемой в обеспечение ГОЗ) и ГОСТ 24297 (для гражданской продукции).',
                'Входной контроль осуществляется с применением поверенных или аттестованных технических средств для измерения, проверенных на работоспособность технических средств для мониторинга, прошедшего техническое обслуживание вспомогательного оборудования. Рабочие места обеспечены учтенными экземплярами актуальной нормативной документацией.',
                'Наличие, полнота, актуальность записей результатов входного контроля.',
                'Действия в случае обнаружения несоответствий закупаемой продукции, включая меры по предотвращению применения продукции (комплектующих изделий, материалов), предполагаемой как контрафактная,  определены в процедуре, выполняются, документируются.',
                'Проводится идентификация и изоляция несоответствующей закупаемой продукции (комплектующих изделий, материалов). Изоляторы брака (участки) должны обеспечивать невозможность смешения забракованной продукции с годной.',
                'Персонал, участвующий во входном контроле, обучен методам обнаружения продукции, предполагаемой как контрафактная.',

                'Наличие порядка (документированной процедуры) проведения контроля технологических процессов, контроля качества. ',
                'При производстве продукции (выполнении работ) осуществляется контроль и проверка ключевых характеристик продукции (операционный контроль), в соответствии с установленными процессами. Записи результатов контроля ведутся.',
                'Действия в случае обнаружения несоответствующей требованиям продукцией (работами, услугами) определены и выполняются. В документированной информации утвержден порядок повторного предъявления возвращенной ВП (при наличии) продукции, предусматривающей подписание предъявительских документов высшим руководством организации.',
                'Производится идентификация и изоляция несоответствующей продукции.',
                'На производстве имеются посты контроля качества (лаборатория). На постах должно быть: <br>– необходимая оснастка и инструмент;<br>– учтенные и поверенные средства измерений;<br>– учтенные эталоны или контрольные образцы (если применяются);<br>– средства для регистрации результатов и ведения записей;<br>– учтённая документация (рабочие инструкции, КД и ТД, журналы контроля.',

                'Наличие порядка (документированной процедуры) проведения испытаний, измерения и приемки продукции (работ, услуг).',
                'Наличие ресурсов (лаборатории, постов контроля) для предъявительских, приемо-сдаточных, периодических, типовых испытаний готовой продукции. На постах должно быть: <br>– необходимая оснастка и инструмент;<br>– учтенные и поверенные средства измерений, аттестованное испытательное оборудование;<br>– учтенные эталоны или контрольные образцы (если применяются);<br>– средства для регистрации результатов и ведения записей;<br>– учтённая документация (рабочие инструкции, КД и ТД, журналы испытаний).',
                'Наличие действующих договоров на проведение испытаний или некоторых из видов испытаний  в сторонних организациях.',
                'Наличие свидетельств аттестации исполнителей. Соответствие уровня квалификации персонала.',
                'Наличие, полнота, актуальность записей результатов испытаний.',
                'Наличие, полнота, актуальность программ и методик испытаний.',
                'Испытания проводятся в соответствии с методикой. Методики проведения испытаний (контроля) продукции содержат, в том числе, перечень подтверждаемых параметров продукции (работ, услуг) и допуски на них, где это возможно, нормы точности измерений (достоверности контроля), правила выбора технических средств для мониторинга и измерения продукции (работ, услуг).',
                'Технические средства для измерения (испытания) продукции поверены (аттестованы), имеют комплект ЭД. Вспомогательное оборудование обслуживается.',
                'Наличие, актуальность, полнота, выполнение графиков аттестации и обслуживания испытательного оборудования.',

                'Наличие метрологической службы (либо другого структурного подразделения или должностного лица) ответственной за обеспечение единства измерений.',
                'Наличие, полнота, актуальность документированных процедур по организации и проведению метрологических работ.',
                'Наличие перечней (единого перечня) технических средств для мониторинга и измерения. Разработка и ведение перечней осуществляется в соответствии с порядком, установленным организацией.',
                'Технические средства для мониторинга и измерения работоспособны, проверены (поверены или аттестованы), применяются подразделениями в соответствии с ЭД или порядком, установленным организацией.',
                'Метрологическая служба обеспечена ресурсами для мониторинга и измерения (технические средства для мониторинга и измерения, персонал, документированная информация и процедуры, помещения) в полном объеме.',
                'Наличие документированной процедуры по проведению метрологического надзора за соблюдением установленных законодательством РФ метрологических требований, правил и норм обеспечения единства измерений, состоянием и применением средств изменения, испытательного оборудования и стандартных образцов, наличием и соблюдением методик измерений.',
                'Наличие, полнота, актуальность, выполнение порядка метрологической экспертизы / контроля технической документации.',

                'Наличие, полнота, актуальность документированной процедуры по рекламационной работе.',
                'Регистрация и учёт рекламаций потребителей проводится в соответствии с установленным порядком.',
                'Связь с потребителями (переписка, выезды к потребителю и совместные исследования причин отказов) проводится в соответствии с установленным порядком.',
                'Осуществляется удовлетворение рекламаций (реализуются меры по устранению выявленных конструктивных и производственных дефектов) в течение срока действия гарантийных обязательств.',

                'Анализ отказавшей продукции проводится  после получения рекламации по согласованным с ВП (при наличии) программам исследования. Результаты анализа оформляются в виде документированной информации.',
                'Наличие анализа данных о качестве закупаемых комплектующих изделий, материалов по результатам входного контроля и применения их при создании серийной продукции (выполнении работ, оказании услуг) или опытных образцов.',
                'Наличие анализа динамики показателей качества продукции (работ, услуг).',
                'Наличие анализа данных о повторяющихся дефектах продукции, выявленных при приемочных испытаниях, при рассмотрении рекламаций и сообщений об отказах и повреждениях продукции.'
            ],
            'standard' => [
                'Требование ОСК  (5.3.5)',

                '8.4.2  (8.4.2.5)',
                '8.1 (8.4.2.5)',
                '8.4.2 (8.4.2.5)',
                '7.1.5, 7.5.3 (7.1.5, 7.5.3)',
                '7.5.1 (7.5.1, 8.4.2.5)',
                '8.4.2 (8.1.7)',
                '8.7 (8.7.7)',
                '(8.1.7)',

                '8.5.1 (8.5.1.2 в)',
                '8.5.1 (8.5.1.9 и)',
                '8.7 (8.7.3, 8.7.8)',
                '8.7 (8.7.7)',
                '8.5.1 (8.5.1.9)',

                '8.5.1 (8.5.1.2 в)',
                '8.6, 9.1.1 (8.6.2, 9.1.1)',
                '8.4.2 (7.1.5.14, 8.4.2.6)',
                '7.2 (7.2, 9.1.1.5 и)',
                '8.6 (9.1.1.5 д)',
                '9.1.1 (9.1.1.4)',
                '9.1.1 (9.1.1.4)',
                '7.1.5 (7.1.5, 8.5.1.6)',
                '7.1.5 (7.1.5, 8.5.1.7)',

                '(7.1.5.9)',
                '4.4.1, 7.1.5.1 (7.1.5.4)',
                '(7.1.5.3, 7.1.5.7 а)',
                '(7.1.5.8, 7.1.5.7 б)',
                '7.1.5.1 (7.1.5.4)',
                '7.1.5 (7.1.5.8)',
                '7.1.5 (7.1.5.8)',

                '(8.7.3)',
                '8.7.2 (8.7.3)',
                '8.5.5, 8.7.1, 8.7.2 (8.7.6)',
                '8.5.5 (8.5.5.2 и)',

                '(8.7.6)',
                '9.1.3 (9.1.3.2 д)',
                '9.1.3 (9.1.3.2 л)',
                '9.1.3 (9.1.3.2 с)'
            ],
            'weights' => [
                2,
                2, 2, 1, 1, 1, 2, 1, 2,
                1, 1, 1, 1, 1,
                1, 1, 1, 1, 1, 1, 1, 1, 1,
                1, 2, 1, 1, 1, 1, 1,
                1, 1, 1, 1,
                1, 1, 1, 2
            ],
            'custommarks' => []
        ],
        7 => [
            'title' => 'Управление персоналом',
            'categories' => [
                [
                    'Численность и кадровый состав персонала',
                    'Развитие и аттестация персонала',
                    'Уровень заработной платы и мотивация персонала',
                    'Планирование организации труда',
                    'Информирование  и осведомлённость  персонала'
                ],
                [
                    [0, 1],
                    [2, 3, 4, 5, 6, 7, 8, 9],
                    [10, 11],
                    [12],
                    [13, 14]
                ]
            ],
            'criteria' => [
                'Соответствие фактической численности работников штатному расписанию (основные, вспомогательные рабочие, руководители и специалисты).',
                'В организации определены источники пополнения (привлечения) человеческих ресурсов для удовлетворения производственных нужд в целях своевременного и качественного выполнения требований заказчика, заключенных договоров. Организация при необходимости использует аутсорсинг (передача процесса или объема работ сторонней организации) и/или аутстаффинг персонала (аренда персонала).',

                'Наличие, полнота, актуальность, выполнение процедуры по работе с персоналом: подбор, прием на работу, адаптация.',
                'Требования к компетентности персонала определены в должностных инструкциях и положениях о подразделениях.',
                'Наличие утвержденного плана по подготовке персонала, включая повышение квалификации. Подтверждение выполнения плана.',
                'Наличие документа о назначении квалификационной комиссии.',
                'Участие персонала в выставках, конференциях по профилю предприятия.',
                'Установлен порядок подготовки, переподготовки и аттестации (где это необходимо) персонала.',
                'Определены категории персонала, для которых в обязательном порядке проводится периодическая аттестация, а также установлена периодичность ее проведения и организовано своевременное доведение данной информации до персонала.',
                'Осуществляется регистрация, хранение и своевременная актуализация персональных данных, касающихся квалификации, подготовки, переподготовки и аттестации персонала.',

                'Заработная плата работников соответствует средней по региону.',
                'Наличие, функционирование, актуальность положения о премировании.',

                'Наличие, полнота, актуальность правил внутреннего трудового распорядка.',

                'Информирование персонала о политике и целях в области качества, своем вкладе в результативность СМК, включая пользу от улучшения результатов деятельности, а также, о требованиях нормативных правовых актов, нормативных  и других документов, распространяющихся на создаваемую продукцию (выполняемые работы).',
                'Подтверждение ознакомления работников под подпись с принимаемыми локальными нормативными актами, непосредственно связанными с их трудовой деятельностью, в соответствии с требованиями статьи 22 Трудового кодекса РФ.'
            ],
            'standard' => [
                '7.1.2 (7.1.2)',
                '7.1.1 (7.1.1.3)',

                '7.1.1 (7.1.1.3)',
                '(7.2.2)',
                '7.2.1 (7.2.3)',
                'Требование ОСК',
                'Требование ОСК',
                '7.2.1 (7.1.2.2 б)',
                '7.2.1 (7.1.2.2 в)',
                '7.2.1 (7.1.2.2 г)',

                'Требование ОСК',
                'Требование ОСК',

                'Требование ОСК',

                '7.3 (7.3.2)',
                '5.2.2, 7.3'
            ],
            'weights' => [
                1, 1,
                1, 1, 1, 1, 1, 1, 2, 1,
                1, 1,
                1,
                1, 1
            ],
            'custommarks' => []
        ],
        8 => [
            'title' => 'Закупки',
            'categories' => [
                [
                    'Организация закупочной деятельности',
                    'Оценка и выбор внешних поставщиков',
                    'Рекламационная работа с внешними поставщиками'
                ],
                [
                    [0, 1, 2],
                    [3, 4, 5, 6, 7],
                    [8, 9, 10]
                ]
            ],
            'criteria' => [
                'Разработан, внедрен регламент процесса «Закупки». Поддерживается взаимодействие со смежными бизнес-процессами.',
                'Наличие перечня (реестра) внешних поставщиков и сторонних организаций (должны быть указаны статус одобрения (например: одобрен, условно одобрен, отклонен) и область одобрения (например, тип продукции, вид процесса).',
                'Документированы требования к деятельности внешних поставщиков после поставки продукции (выполнения работ, оказания услуг) и другие требования, необходимые для обеспечения поставки продукции (выполнения работ, оказания услуг) в установленные сроки, в требуемом количестве и надлежащего качества.',

                'Наличие, полнота, актуальность документированной процедуры по оценке и выбору внешних поставщиков, мониторингу их деятельности, а также повторной оценки.',
                'Оценка внешних поставщиков производится, актуальна, подтверждающие документы представлены.',
                'Установлены требования к внешним поставщикам продукции (работ, услуг) на всех уровнях кооперации по предотвращению применения внешними поставщиками контрафактной продукции в процессе создания продукции (выполнения работ, оказания услуг).',
                'Наличие, полнота, актуальность документированной процедуры по аудиту поставщиков (оценка деятельности внешних поставщиков), предусмотрен график аудита поставщиков.',
                'Аудит внешних поставщиков (оценка деятельности внешних поставщиков) проводится регулярно.',

                'Определен порядок ведения рекламационной работы с внешними поставщиками и сторонними организациями. ',
                'Документы, подтверждающие проведение рекламационной работы (уведомления о вызове представителя поставщика, рекламационные акты, акты исследования, акты удовлетворения рекламаций) в наличии, корректны. ',
                'Проводится совместная работа с поставщиками над улучшением качества продукции (имеется переписка, протоколы, другие подтверждающие документы).'
            ],
            'standard' => [
                '4.4, 8.1.1, 8.4.1 (8.1.2, 8.4.1)',
                '8.4.1 (8.4.1.8 б)',
                '8.4.1 ( 8.4.1.2 г)',

                '8.4.1 (8.4.1.5)',
                '8.4.1 (8.4.1.5)',
                '8.4.1 (8.4.1.4 г)',
                '8.4.2 (8.4.2.4, 8.4.1.8 в)',
                '8.4.2 (8.4.2.4, 8.4.1.8 в)',

                '8.4.2 (8.4.2.5)',
                '8.4.2, 8.4.3 (8.4.3)',
                '10.2 (10.2, 8.4.2.6)'
            ],
            'weights' => [
                2, 1, 1,
                2, 2, 1, 1, 1,
                1, 2, 2
            ],
            'custommarks' => []
        ],
        9 => [
            'title' => 'Складское хозяйство',
            'categories' => [
                [
                    'Состояние складского хозяйства',
                    'Организация работы складского хозяйства',
                    'Организация рабочих мест работников складов (РМ)',
                    'Упаковывание и отгрузка готовой продукции'
                ],
                [
                    [0, 1, 2, 3, 4],
                    [5, 6, 7, 8, 9, 10, 11, 12],
                    [13, 14],
                    [15, 16]
                ]
            ],
            'criteria' => [
                'Наличие изолированных, защищённых от погодных условий и оборудованных складских помещений для хранения готовой продукции.',
                'Наличие изолированных, защищённых от атмосферных осадков и оборудованных складских помещений для хранения комплектующих, сырья и материалов.',
                'Состояние складских помещений: освещённость, отопление, вентиляция, транспортные подходы, общее состояние.',
                'Поддержание порядка на складах (своевременная уборка помещений, вывоз мусора и упаковочных материалов). Определен ответственный, имеется процедура инвентаризации и уборки.',
                'Наличие утверждённых планировок по каждому складу (с указанием оборудования, рабочих мест, зон погрузки-разгрузки, зон погрузо-разгрузочной техники, тары, бытового мусора и отходов, изоляторов брака, эвакуационных выходов, схемы движения транспорта, расстояний от стен и пр.).',

                'Наличие документированной процедуры предусматривающей:<br>а) погрузочно-разгрузочные работы и внутреннее транспортирование (на склад готовой продукции и т.п.);<br>б) складирование и временное хранение;<br>в) упаковывание, включая консервацию;<br>г) отгрузку и транспортирование.',
                'В процедуре погрузочно-разгрузочных работ установлены требования:<br>а) к составу и характеристикам применяемых грузоподъемных средств и оборудования;<br>б) к квалификации персонала и его ответственности за качество выполняемых работ;<br>в) к методам и процедурам приемки и маркировки продукции при внутризаводской транспортировке;<br>г) к составу и характеристикам транспортной тары.',
                'В процедурах складирования и хранения продукции установлены требования:<br>а) к складским помещениям и условиям хранения (температура, влажность);<br>б) к составу и характеристикам применяемого оборудования и приспособлений (стеллажи, емкости и др.), обеспечивающих защиту готовой продукции от воздействия механических, климатических и других факторов;<br>в) к порядку приемки на склад и отпуска продукции со склада, предусматривающему сопоставление маркировки с сопроводительной документацией, проверку срока хранения и даты изготовления;<br>г) к методам идентификации и способам складирования продукции различной номенклатуры;<br>д) к методам периодического контроля состояния продукции при хранении.',
                'На складах ведется контроль условий хранения, журналы регистрации окружающей среды ведутся в соответствии с установленной процедурой.',
                'В документированной процедуре (в инструкциях) предусмотрены действия ответственных лиц в случае выхода условий хранения продукции  за допустимые границы.',
                'Продукция на складах идентифицирована, на этикетках (бирках) содержится необходимая информация о продукции.',
                'Хранение исключает пересортицу и смешивание партий, применяется принцип FIFO (FEFO), обеспечивает сохранность.',
                'Имеется, функционирует система управления запасами продукции.',

                'Оснащение РМ (наличие, актуальность, выполнение документированной процедуры по требованиям к РМ, состояние, достаточность):<br>– необходимый инструмент;<br>– необходимая промышленная мебель.',
                'Документация на РМ (полнота, актуальность, доступность, уровень визуализации, ознакомленность персонала) — возможно в виде визуализации:<br>– должностные (рабочие) инструкции<br>– инструкция по охране труда и технике безопасности,<br>– необходимая информация о хранимой продукции, таре, упаковке.',

                'В процедурах упаковывания и поставки (отгрузки) продукции установлены требования:<br>а) к методам и способам упаковывания и маркировки готовой продукции, исключающим ее повреждение в процессе хранения и транспортирования;<br>б) к методам контроля качества упаковывания продукции.',
                'Подтверждается соблюдение требований к упаковыванию и поставке (отгрузке) продукции.'
            ],
            'standard' => [
                '7.1.3',
                '7.1.3',
                '7.1.4',
                '7.1.4',
                '7.1.4',

                '8.1 (8.5.4.2)',
                '8.1 (8.5.4.4)',
                '8.1 (8.5.4.6)',
                '7.1.4',
                '8.7',
                '8.5.2',
                '8.5.4',
                'Требование ОСК',

                '7.1.3',
                '8.5.1',

                '8.1 (8.5.4.6)',
                '8.5.4'
            ],
            'weights' => [
                1, 1, 1, 1, 1,
                1, 1, 1, 1, 1, 1, 2, 2,
                1, 1,
                1, 1
            ],
            'custommarks' => []
        ],
    ];

    define('CHECKLISTS', $checklists);
    define('COEFFTONUM', $coeff_to_num);

    function get_final_for_checklist ($audit, $checklists = CHECKLISTS, $coeff_to_num = COEFFTONUM) {
        $sumfinal = 0;
        $finals = [];

        $full = true;

        for ($i = 0; $i <= 9; $i++) {
            if ($audit['checklists'][$i]) {

                $marks = $audit['marks'];

                $unedited = (count(array_filter($marks[$i], function ($value) {
                    return $value === -1;
                })));
                $edited = (count(array_filter($marks[$i], function ($value) {
                    return $value !== -1;
                })));

                if ($unedited === 0) {
                    $resmark = 0;

//                    var_dump($i);
                    foreach ($checklists[$i]['categories'][0] as $j => $category) {

                        foreach ($checklists[$i]['categories'][1][$j] as $criteria) {
                            $thismark = $marks[$i][$criteria];
                            $w = $checklists[$i]['weights'][$criteria];
                            $resmark += $thismark === -2 ? 0 : ($thismark === -1 ? 0 : $thismark * $w);
                        }

                    }

                    $maxmarksum = 0;

                    foreach ($checklists[$i]['weights'] as $j => $weight) {
                        if ($marks[$i][$j] !== -2) {
                            $maxmarksum += $weight;
                        }
                    }

                    if ($maxmarksum === 0) {
                        $maxmarksum = 1;
                    }

                    $checklistweight = $audit['weights'][$i];
                    $coeff = $coeff_to_num[$audit['coeff']];
                    $wmark = round($checklistweight * ($resmark / $maxmarksum * 100), 3);
                    $final = round($wmark * $coeff, 2);
                    $sumfinal += $final;
                    $finals[] = $final;
                } else {
                    $finals[] = 0;
                    $full = false;
                }
            } else {
                $finals[] = 0;
            }
        }

        if ($sumfinal >= 86) {
            $class = 'A';
        } else if ($sumfinal >= 70) {
            $class = 'B';
        } else if ($sumfinal >= 50) {
            $class = 'C';
        } else {
            $class = 'D';
        }

        return [
            'final' => round($sumfinal),
            'checklists' => $finals,
            'class' => $class,
            'full' => $full
        ];
    };
